Revit 2026 API

# FabricationConfigurationCanBeSwapped Method

---

Checks if the fabrication configuration can be swapped.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanBeSwapped()
```
```vb
Public Function CanBeSwapped As Boolean
```
```cpp
public:
bool CanBeSwapped()
```
```fsharp
member CanBeSwapped : unit -> bool
```

#### Return Value

Boolean True if the fabrication configuration can be swapped, false otherwise.

Swapping configuration is not permitted if the existing configuration has already been used to create fabrication part elements in the document.

#### Reference

FabricationConfiguration Class

Autodesk.Revit.DB Namespace